export const PRODUCTS = [
  {
    id: "w14",
    name: "Mercedes-AMG F1 W14 E Performance",
    price: 17010,
    oldPrice: 18900,
    category: "F1 Серия",
    images: [
      "/BrickCars/images/w14.JPG",
      "/BrickCars/images/w142.PNG",
      "/BrickCars/images/w143.JPG",
      "/BrickCars/images/w144.JPG",
    ],
    description:
      "Обуздай мощь «Черной стрелы». Эта модель в глубоком цвете Carbon Black — манифест технического превосходства Mercedes. Ощути ювелирную работу поршневой группы V6 и идеальную аэродинамику. Собранный тобой болид станет символом безупречного стиля и немецкой точности, который приковывает взгляды в любом интерьере.",
    specs: {
      Масштаб: "1:8",
      Детали: "1642 шт.",
      Длина: "≈ 60 см",
      Особенности: "Система DRS и поршневая группа V6",
    },
  },
  {
    id: "sf24",
    name: "Ferrari SF-24",
    price: 17065,
    oldPrice: 18900,
    category: "F1 Серия",
    images: [
      "/BrickCars/images/sf24.JPG", 
      "/BrickCars/images/sf242.PNG"],
    description:
      "Почувствуй огонь в сердце с иконой автоспорта в цвете Rosso Corsa. SF-24 — это воплощение итальянской страсти и гоночного наследия Маранелло. Съемный кожух двигателя открывает доступ к сложнейшей механической трансмиссии, позволяя оценить гений инженеров Ferrari.",
    specs: {
      Масштаб: "1:8",
      Детали: "1361 шт.",
      Длина: "≈ 58-60 см",
      Особенности: "Съемный кожух и трансмиссия",
    },
  },
  {
    id: "rb20",
    name: "Red Bull Racing RB20",
    price: 17850,
    oldPrice: 21000,
    category: "F1 Серия",
    images: [
      "/BrickCars/images/rb201.JPG",
      "/BrickCars/images/rb202.PNG",
    ],
    description:
      "В твоих руках — машина, которая переписала историю Формулы-1. Матовый Navy Blue и агрессивные обтекатели RB20 созданы для тех, кто признает только первое место.",
    specs: {
      Масштаб: "1:8",
      Детали: "1639 шт.",
      Длина: "≈ 60 см",
      Особенности: "Рабочая подвеска и матовая ливрея",
    },
  },
  {
    id: "mclaren-mcl39",
    name: "McLaren MCL39 F1 Team (2025)",
    price: 17910,
    oldPrice: 19900,
    category: "F1 Серия",
    images: [
      "/BrickCars/images/mclaren.JPG",
      "/BrickCars/images/mcl39.PNG"
    ],
    description:
      "Флагман твоего домашнего паддока в легендарной ливрее «папайя». Это не просто модель, а инженерный вызов в масштабе 1:8.",
    specs: {
      Масштаб: "1:8",
      Детали: "1675 шт.",
      Длина: "61 см",
      Особенности: "Система DRS, двигатель V6 и подвеска 2025 года",
    },
  },
  {
    id: "daytona-sp3",
    name: "Ferrari Daytona SP3",
    price: 32000,
    oldPrice: 39900,
    category: "Гиперкар",
    images: ["/BrickCars/images/daytona.JPG"],
    description:
      "Ультимативный гиперкар для тех, кто ценит совершенство. 3778 деталей превращаются в шедевр с работающей 8-ступенчатой секвентальной КПП.",
    specs: {
      Масштаб: "1:8",
      Детали: "3778 шт.",
      Длина: "59 см",
      Особенности: "8-ступенчатая КПП и двигатель V12",
    },
  },
  {
    id: "lambo-sian",
    name: "Lamborghini Sián FKP 37",
    price: 32000,
    oldPrice: 39900,
    category: "Гиперкар",
    images: ["/BrickCars/images/sian.JPG"],
    description:
      "Взрыв адреналина в цвете Lime Green. Этот гиперкар будущего бросает вызов обыденности своими дверями-ножницами и активным спойлером.",
    specs: {
      Масштаб: "1:8",
      Детали: "3696 шт.",
      Длина: "60 см",
      Особенности: "Двери-ножницы и активный спойлер",
    },
  },
  {
    id: "mclaren-p1-ultimate",
    name: "McLaren P1",
    price: 32000,
    oldPrice: 39900,
    category: "Гиперкар",
    images: ["/BrickCars/images/p1.JPG"],
    description:
      "Вершина инженерной мысли и абсолютный технический шедевр в масштабе 1:8. McLaren P1 — это вызов для избранных.",
    specs: {
      Масштаб: "1:8",
      Детали: "3893 шт.",
      Длина: "≈ 60 см",
      Особенности: "7-ступенчатая КПП, двигатель V8 и активная аэродинамика",
    },
  },
];
